#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mod_Flamethrower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RangedWeapon_Mod_WeaponMode_classes.hpp"
#include "GunfireRuntime_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mod_Flamethrower.Mod_Flamethrower_C
// 0x0020 (0x0730 - 0x0710)
class AMod_Flamethrower_C final : public ARangedWeapon_Mod_WeaponMode_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mod_Flamethrower_C;                 // 0x0710(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FlameImpactDamage;                                 // 0x0718(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x071C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FireTick;                                          // 0x0720(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_721[0x3];                                      // 0x0721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OnFireDoTDamage;                                   // 0x0724(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FirePuddleDoTDamage;                               // 0x0728(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WeakSpotMod;                                       // 0x072C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mod_Flamethrower(int32 EntryPoint);
	void UpdateFlamethrowerVFX(const struct FVector& from, const struct FVector& to);
	void OnFireEnd();
	void OnFireBegin();
	void OnFire(const struct FVector& from, const struct FVector& to, float WeaponSpread);
	void ModifyDamage(struct FDamageInfo& Info, bool* Rtn);
	void ModifyInspectInfo(class AActor* Actor, class UItemInstanceData* InInstanceData, struct FInspectInfo& Info, bool* Rtn);
	void GetOnFireDoTDamage(float* Out);
	void GetFirePuddleDoTDamage(float* Out);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Mod_Flamethrower_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Mod_Flamethrower_C")
	}
	static class AMod_Flamethrower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMod_Flamethrower_C>();
	}
};
DUMPER7_ASSERTS_AMod_Flamethrower_C;

}

